# ; Нужно написать программу, которая запрашивает у пользователя два целых числа 
# ; и выводит площадь прямоугольника в формате, который указан в примере.

# ; Формула нахождения площади прямоугольника: S = a * b

number_1 = int(input("Введите первое число"))
number_2 = int(input("Введите второе число"))
S = number_1 * number_2
print(S)
