# Нужно написать программу, которая запрашивает у пользователя два целых числа и 
# выводит площадь прямоугольного треугольника в формате float.

# Внимание: площадь прямоугольного треугольника равна половине площади прямоугольника.

number_1 = float(input("Введите первое число > "))
number_2 = float(input("Введите второе число > "))
S = (number_1 * number_2)/2
print(S)