# Нужно написать программу, которая запрашивает у пользователя слово и дублирует его три раза.

# Внимание: слова выводятся в одну строку и разделены между собой пробелами.

word = str(input("Enter a word > "))
print(word, word, word)